package other.O007.question;

/**
 * 문제 푼 횟수 : 2
 * <p>
 * 여기에 777개의 짐이 있어, 각각의 무게는 1kg, 2kg, 3kg,……, 777kg이 되고 있습니다. 이들을 최대 적재량 5000kg의 트럭을 몇대나 사용해 운반하려고 하고 있습니다.
 * <p>
 * 트럭에 짐을 싣는데 다음과 같은 정책을 세웠습니다.
 * <p>
 * 무거운 짐부터 순서대로 트럭에 올려 간다.
 * 한 짐을 실으면 최대 적재량을 넘어 버리는 경우는, 새로운 트럭을 준비해 그곳에 싣는다. 낡은 쪽의 트럭에는 이후는 새로운 짐은 실리지 않는다.
 * 이 정책에 따르면,
 * <p>
 * 1대째의 트럭에는 777kg, 776kg, 775kg, 774kg, 773kg, 772kg의 짐이 실린다.
 * 두 번째 트럭에는 771kg, 770kg, 769kg, 768kg, 767kg, 766kg의 짐이 실려있다.
 * 됩니다. 결국 몇 대의 트럭이 필요한지 물어보십시오.
 */

public class Q1 {
    public static void main(String[] args) {
    }
}
