package atcoder.B085.question;

import java.util.HashSet;
import java.util.Scanner;
import java.util.Set;

/**
 * 문제 푼 횟수 : 2
 *
 * X 段重ねの鏡餅
 * (X≥1) とは、
 * X 枚の円形の餅を縦に積み重ねたものであって、どの餅もその真下の餅より直径が小さい（一番下の餅を除く）もののことです。例えば、直径
 * 10、8、6 センチメートルの餅をこの順に下から積み重ねると
 * 3 段重ねの鏡餅になり、餅を一枚だけ置くと1 段重ねの鏡餅になります。
 *
 * ダックスフンドのルンルンは
 * N 枚の円形の餅を持っていて、そのうちi 枚目の餅の直径はdiセンチメートルです。これらの餅のうち一部または全部を使って鏡餅を作るとき、最大で何段重ねの鏡餅を作ることができるでしょうか。
 *
 * 예1)
 * 4
 * 10
 * 8
 * 8
 * 6
 * →
 * 3
 *
 * 예2)
 * 3
 * 15
 * 15
 * 15
 * →
 * 1
 *
 * 예3)
 * 7
 * 50
 * 30
 * 50
 * 100
 * 50
 * 80
 * 30
 * →
 * 4
 */

public class Q1 {
    public static void main(String[] args) {
    }
}
