package atcoder.B088.question;

import java.util.*;

/**
 * 문제 푼 횟수 : 2
 * <p>
 * N 枚のカードがあります。
 * i 枚目のカードには, Xという数が書かれています。
 * Alice と Bob は, これらのカードを使ってゲームを行います. ゲームでは, Alice と Bob が交互に 1 枚ずつカードを取っていきます. Alice が先にカードを取ります。
 * 2人がすべてのカードを取ったときゲームは終了し, 取ったカードの数の合計がその人の得点になります。
 * 2 人とも自分の得点を最大化するように最適な戦略を取った時, Alice は Bob より何点多く取るか求めてください。
 * <p>
 * 예1)
 * 2
 * 3 1
 * →
 * 2
 * <p>
 * 예2)
 * 3
 * 2 7 4
 * →
 * 5
 * <p>
 * 예3)
 * 4
 * 20 18 2 18
 * →
 * 18
 */

public class Q1 {
    public static void main(String[] args) {
    }
}
