package atcoder.C085.question;

/**
 * 문제 푼 횟수 : 1
 *
 * 日本でよく使われる紙幣は、
 * 10000 円札、
 * 5000 円札、
 * 1000 円札です。以下、「お札」とはこれらのみを指します。
 *
 * 青橋くんが言うには、彼が祖父から受け取ったお年玉袋にはお札が
 * N 枚入っていて、合計で
 * Y 円だったそうですが、嘘かもしれません。このような状況がありうるか判定し、ありうる場合はお年玉袋の中身の候補を一つ見つけてください。なお、彼の祖父は十分裕福であり、お年玉袋は十分大きかったものとします。
 *
 * 예1)
 * 9 45000
 * →
 * 4 0 5
 *
 * 예2)
 * 20 196000
 * →
 * -1 -1 -1
 *
 * 예3)
 * 1000 1234000
 * →
 * 14 27 959
 *
 * 예4)
 * 2000 20000000
 * →
 * 2000 0 0
 */

public class Q1 {
    public static void main(String[] args) {

    }
}
